--- a/README.md
+++ b/README.md
@@ -6,39 +6,18 @@
-## 🏗 Архитектура данных & Пайплайн (Medallion Architecture)
+## 🏗 Концептуальная архитектура потоков данных (Medallion Architecture)
 
-```text
-               ┌─────────────────────────────────────────┐
-               │  Сырые медицинские данные (Raw JSON)    │
-               └────────────────────┬────────────────────┘
-                                    │
-                                    ▼ [PySpark ETL: Bronze → Silver]
-               ┌────────────────────┴────────────────────┐
-               │ Наложение схемы, валидация & сбор DQ    │
-               └────────┬────────────────────────┬───────┘
-                        │                        │
-          [Массив errors ПУСТОЙ]          [Массив errors НЕ пустой]
-                        │                        │
-                        ▼                        ▼
- ┌──────────────────────┴──────┐          ┌──────┴──────────────────────┐
- │ Yandex S3: Silver (Iceberg) │          │  Yandex S3: Quarantine/DLQ  │
- └──────────────┬──────────────┘          └─────────────────────────────┘
-                │
-                ▼ [PySpark ETL: Silver → Gold]
- ┌─────────────────────────────┐
- │  Yandex S3: Gold (Iceberg)  │
- └──────────────┬──────────────┘
-                │
-                ▼ [Airflow: dbt-clickhouse container]
- ┌─────────────────────────────┐
- │       DWH: ClickHouse       │
- └──────────────┬──────────────┘
-                │
-                ▼ [BI Analytics]
- ┌─────────────────────────────┐
- │       Apache Superset       │
- └─────────────────────────────┘
+```mermaid
+graph TD
+    RAW[Сырые медицинские данные Raw JSON] -->|&nbsp; Bronze → Silver &nbsp;| VAL[Схема, валидация, DQ]
+    
+    VAL -->|&nbsp; No errors &nbsp;| SLV[Yandex S3: Silver Iceberg]
+    VAL -->|&nbsp; Errors &nbsp;| DLQ[Yandex S3: Quarantine/DLQ]
+    
+    SLV -->|&nbsp; Silver → Gold &nbsp;| GLD[Yandex S3: Gold Iceberg]
+    GLD -->|&nbsp; dbt-clickhouse &nbsp;| CH[DWH: ClickHouse]
+    CH -->|&nbsp; BI Analytics &nbsp;| SUP[Apache Superset]
 ```
 
 ### Поток данных
